[Killed] BlockStatement
gradeToLetter.js:1:48
-module.exports = function gradeToLetter(score) {
-
-  if (typeof score !== 'number') {
-    return 'Invalid input. Please provide a number.';
-  }
-
-  if (score >= 90) {
-    return "A";
-  } else if (score >= 80) {
-    return "B";
-  } else if (score >= 70) {
-    return "C";
-  } else if (score >= 60) {
-    return "D";
-  } else {
-    return "F";
-  }
-}
+module.exports = function gradeToLetter(score) {}
killedBy: calculateGrade should return 'A' for a score of 90
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: undefined

[Killed] BlockStatement
gradeToLetter.js:3:34
 module.exports = function gradeToLetter(score) {
 
-  if (typeof score !== 'number') {
-    return 'Invalid input. Please provide a number.';
-  }
+  if (typeof score !== 'number') {}
 
   if (score >= 90) {
killedBy: calculateGrade should return an error for a non-numeric input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid input. Please provide a number."
Received: "F"

[Killed] ConditionalExpression
gradeToLetter.js:3:7
 module.exports = function gradeToLetter(score) {
 
-  if (typeof score !== 'number') {
+  if (false) {
     return 'Invalid input. Please provide a number.';
   }
killedBy: calculateGrade should return an error for a non-numeric input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid input. Please provide a number."
Received: "F"

[Killed] ConditionalExpression
gradeToLetter.js:9:14
 
   if (score >= 90) {
     return "A";
-  } else if (score >= 80) {
+  } else if (true) {
     return "B";
   } else if (score >= 70) {
killedBy: calculateGrade should return 'C' for a score of 70
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "C"
Received: "B"

[Killed] BlockStatement
gradeToLetter.js:9:27
 
   if (score >= 90) {
     return "A";
-  } else if (score >= 80) {
-    return "B";
-  } else if (score >= 70) {
+  } else if (score >= 80) {} else if (score >= 70) {
     return "C";
   } else if (score >= 60) {
killedBy: calculateGrade should return 'B' for a score of 80
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: undefined

[Killed] EqualityOperator
gradeToLetter.js:11:14
     return "A";
   } else if (score >= 80) {
     return "B";
-  } else if (score >= 70) {
+  } else if (score < 70) {
     return "C";
   } else if (score >= 60) {
killedBy: calculateGrade should return 'C' for a score of 70
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "C"
Received: "D"

[Killed] StringLiteral
gradeToLetter.js:12:12
   } else if (score >= 80) {
     return "B";
   } else if (score >= 70) {
-    return "C";
+    return "";
   } else if (score >= 60) {
     return "D";
killedBy: calculateGrade should return 'C' for a score of 70
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "C"
Received: ""

[Killed] ConditionalExpression
gradeToLetter.js:13:14
     return "B";
   } else if (score >= 70) {
     return "C";
-  } else if (score >= 60) {
+  } else if (false) {
     return "D";
   } else {
killedBy: calculateGrade should return 'D' for a score of 60
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "D"
Received: "F"
